Eating healthy helps to prevent and treat many chronic diseases such as obesity, high blood pressure, cardiovascular diseases, metabolic diseases, type 2 diabetes, and some forms of cancer
It's important to cover your mouth and nose when sneezing. By doing it, secretions from your mouth and nose don't go into the air and spread to other people.
People can also be infected with respiratory diseases such as the flu or the common cold, if they don't wash their hands before touching eyes, nose, or mouth.
Regular check-ups can help find potential health issues before they become a problem. Early detection gives you the best chance for getting the right treatment quickly, avoiding any complications.
Quitting smoking has many benefits such as improved respiratory capacity, cardiocirculatory function, skin rejuvenation, reduced susceptibility to infectious diseases and lung cancer.
Sleep deprivation could increase your risk of heart disease, obesity and diabetes in the long run. Be sure to get at least 7 hours of sleep per night to improve your psychosocial well-being.
Excessive stress can lead to cardiovascular problems, such as stroke and heart attack. Practicing yoga, tai chi, or gardening, can help you relax and release tension.
An active social life has good repercussions on our health. Spending time having fun with friends or family reduces stress and the risk of hypertension, obesity and diabetes.
Cognitive functioning decreases as we age. To slow this loss, read books, study some topics that interest you, learn a foreign language, listen to music, or practice crossword puzzles or sudoku.
Vitamin D is one of the most important nutrients for overall health, and sunlight is one of our best sources of it. Aim to get at least 30 minutes of sunlight every day. 
Taking the stairs instead of the elevator is a simple way to get a little more physical activity in your daily life. It also strengthens and tones your legs and core while you’re at it!
Use a fitness tracker to track your steps. It is an easy way to make sure you’re getting enough physical activity each day. You should aim for 10,000 steps daily, which has significant physical and mental health benefits.
Fiber in your diet will help improve bowel function and avoid constipation. Aim to eat two servings of fruit, five servings of vegetables and five servings of cereals and breads each day.
"Start your morning by drinking a glass of water. Hydrating first thing in the morning helps to aid digestion, enhance skin health and boost energy.
"
Maintaining a healthy gut has significant impacts on digestion, skin health, immunity, and mental health. Taking a daily probiotic with a glass of water each morning is one of the simplest things you can do to boost your gut health.
Reduce the harmful effects of sitting by standing up and moving around for a minute or two every half hour.
Eat plenty of fruits and vegetables as they may help reduce the risk of many diseases, including heart disease, high blood pressure, and some cancers.
To make sure you have sufficient levels of nutrients, taking a daily multivitamin supplement is a good idea, especially when you do not have a variety of vegetables and fruits at home. Many micronutrients are vital to your immune system
Despite being high in fat, nuts are incredibly nutritious and healthy. They’re loaded with magnesium, vitamin E, fiber, and various other nutrients
Eat fish on a regular basis. Fish is a great source of high-quality protein and healthy fat. This is particularly true of fatty fish, such as salmon, which is loaded with omega-3 fatty acids and various other nutrients
Meat can be a nutritious and healthy part of your diet. However, problems occur when meat is overcooked or burnt. This can lead to the formation of harmful compounds that raise your risk of cancer.
When you’re exposed to bright lights in the evening, it may disrupt your production of the sleep hormone melatonin. One strategy is to use a pair of amber-tinted glasses that block blue light from entering your eyes in the evening.
Do 7,500 - 15,000 steps per day. According to the WHO, 10,000 steps corresponds to a good half hour of movement. 
tay hydrated. An adequate daily fluid intake is about 3.7 liters of fluids a day for men and 2.7 liters of fluids a day for women.
Drinking enough water each day is crucial for many reasons. It helps regulate body temperature, keep joints lubricated, prevent infections, deliver nutrients to cells, and keep organs functioning properly.
Make time for meditation. The practice of meditation is relaxing and soothing, and has been found to reduce stress and pain, lower blood pressure and even improve memory.
Your brain is similar to a muscle - you need to use it or you lose it. There are many things that you can do to keep your brain in shape, such as doing crossword puzzles or Sudoku, reading, playing cards or putting together a jigsaw puzzle.
Losing weight can improve your health. It can reduce your risk of heart disease, type 2 diabetes, blood pressure and total cholesterol level.
Don´t skip your rehabilitation. Rehabilitation helps bring back the physical function and mobility you had prior to your injury, and can strengthen outcomes significantly.
Stretching is important because it keeps the muscles flexible, strong, and healthy. Flexibility is needed to maintain a range of motion in the joints. Without it, the muscles shorten and become tight.
Avoid overeating through portion control. Overeating can lead to unhealthy weight gain, a major risk to heart health, so portion control and healthy choices become all the more important.
High levels of bad cholesterol threaten the health of your heart. Limit the amount of foods that contain saturated fats, which can increase your cholesterol.
Music affects our mood. Listening to music for at least 30 minutes a day can lower blood pressure, slow down heart rate and decrease anxiety.
Keep your mouth clean. Keeping your teeth, gums and mouth clean and healthy can prevent disease and infection, and can help to avoid pain and sickness.
Taking better care of our bodies means increased energy levels and a better ability to accomplish our daily goals.
Feet are your body's foundation, so keeping them healthy is vital to your overall health.
Excessive alcohol use can lead to the development of chronic diseases and other serious problems.
An abundance of alcohol can harm the liver, whose job it is to break down harmful substances in the body.
A good intake of HDL is important. HDL is the "good" cholesterol, and helps remove other forms of cholesterol from your bloodstream. Higher levels of HDL cholesterol are associated with a lower risk of heart disease.
Eat calcium rich food. The body needs calcium to maintain strong bones and to carry out many important functions.
Get enough calcium in your diet. Calcium plays an important role in muscle contraction, transmitting messages through the nerves, and the release of hormones.
A good intake of vitamins is important. Vitamins work hard to keep our bodies functioning properly and they help drive essential processes needed in our everyday lives. 
Being mobile is a crucial aspect of being healthy. If a person is not able to move a joint freely through its full range of motion, then they are already putting themselves at an increased risk of injury.
Developing muscular strengths helps to build strong, healthier muscles and bones. You'll have more stability, balance, and flexibility, making injuries and falls less likely.
Take care of your kidneys. They are responsible for filtering and removing waste products from the body, keeping bones healthy, and looking after blood pressure.
Personal hygiene is how you take care of your body. Maintaining hygiene practices reduces the spread of illness and risk of medical conditions caused by not taking care of yourself.
Be honest with your doctor. Doctor-patient confidentiality ensures that you can safely disclose your medical history, illnesses, feelings, and unhealthy habits and know that this sensitive information will be protected and safeguarded.
Good health is central to human happiness and well-being that contributes significantly to prosperity and wealth and even economic progress, as healthy populations are more productive, save more and live longer. 
Good mental health helps you enjoy life and cope with problems. Just as you take care of your body by eating right and exercising, you can do things to protect your mental health.
A healthy gut contains healthy bacteria and immune cells that ward off infectious agents like bacteria, viruses, and fungi.
A healthy gut communicates with the brain through nerves and hormones, which helps maintain general health and well-being.
Take care of your liver. The liver helps your body maintain a healthy level of blood sugar. Your liver supplies glucose to your blood when it's needed.
Keep your liver healthy. If it is healthy, it can remove glucose from your blood when there's too much.
Take care of your lungs. Every cell in your body needs oxygen in order to live. Once in the lungs, oxygen is moved into the bloodstream and carried through your body.
Eye health is important. Changes in your eyes can signal vision problems, diabetes, stress, even retinal detachment.
Salt intake of less than 5 grams per day for adults helps to reduce blood pressure and risk of cardiovascular disease, stroke and coronary heart attack. 
Consuming too much added sugar increases heart disease risk factors such as obesity, high blood pressure and inflammation.
Taking breaks can improve your mood, boost your performance and increase your ability to concentrate. When you don't give your mind a chance to pause and refresh, it doesn't work as efficiently.
By losing fat mass, you may be able to eliminate health issues such as diabetes, heart disease, joint pain, a variety of cancers, high blood pressure and dementia.
Maintaining a healthy blood pressure is very important because the higher your blood pressure, the higher your chances of developing health issues.
Thorough handwashing with soap and water can protect you and others from a range of infectious diseases.
Your mask helps protect those around you. Masks are a simple barrier to help prevent your respiratory droplets from reaching others.
Since people can spread viruses before they know they are sick, it is important to stay at least 6 feet away from others when possible, even if you (or they) do not have any symptoms.
Given that many diseases are curable, preventable or treatable, following your doctor's orders is vital for achieving and maintaining good health.
Your clinician may give you exercises to do at home between appointments. It's important to do them. A lot of the benefit from rehab comes from the work you put in on your own, away from the clinic.
Keep up with your homework, but follow your clinician's instructions to the letter. If you add more weight and reps, or exercise more often than you're told to, you won't heal any faster. You might even set your recovery back or get a new injury.
Tell your clinician if you hurt or get tight or weak during your routines. It will help them keep tabs on your progress.
It's important to stick with your therapy, but don't ignore your body's warning signals. Talk to your clinician about any discomfort, and ask for tips to deal with it.
You may find a good soak in the bath eases your muscle strain and soreness. It also increases your blood flow and helps cut pain that's linked to inflammation.
If you have been given different exercises every session and feel unsure about which exercises to do, ask your clinician to prioritize the 3-5 most important ones. That way, if you feel pressed for time, you can still get your most important exercises in.
If you face any problem, start to have a new source of pain or find difficulties doing exercises you already did, let your clinician know. Every piece of information is important, as it helps your clinician understand the dynamics of your healing process.
Therapy often involves stretching exercises to stimulate the joints and muscles, so wear clothes that won’t impede movement. Pick something breathable and easy to move in that you won’t mind getting a little dirty.
It’s important to take things slow as you recover. Your body needs time to rest and recuperate, and you need to give yourself enough time to build up to your previous level of fitness.
It’s always in your best interest to put some effort into your treatment plan. The more seriously you take your therapy sessions, the sooner you can get back to your old routine.